people/nguyenthanhvuh/old/drafts/nla.org
#+TITLE: Nonlinear Invariants
#+date: <2020-06-01 03:39>
#+description: nonlinear invariants
#+filetags: blog research invariants

** Examples
   :PROPERTIES:
   :CUSTOM_ID: examples
   :END:

*** Capturing Program Semantics
    :PROPERTIES:
    :CUSTOM_ID: capturing-program-semantics
    :END:

Nonlinear equalities can capture precise program semantics involving
nontrivial arithmetics. Consider the =cohendiv= integer division
algorithm below.

#+BEGIN_SRC C
  int cohendiv(int x, int y){
      // performs integer division x // y

      assert(x >= 1 && y >= 1);
      int q = 0;
      int r = x;
      int a = 0;
      int b = 0;
      while(1) {
          if(!(r>=y)) break;

          a=1;
          b=y;
          while (1){
              // l1: inferred invariants
              /*
              1. x = qy+r
              2. ay = b
              3. b <= x
              4. y <= r
              5. 0 <= q
              6. 1 <= b
              7. 1 <= y
              */

              if(!(r >= 2*b)) break;
              a = 2*a;
              b = 2*b;
          }
          r = r - b;
          q = q + a;
      }

      // l2: inferred invariants
      /*
      1. x = yq*r
      2. ay = b
      3. r <= y - 1
      4. 0 <= r
      5. r <= x
      */
      return q;
  }
#+END_SRC

DIG automatically discovers the loop invariants at =l1= and the
postconditions at =l2= shown as comments in the code. These relations
are sufficiently strong to understand the semantics and verify the
correctness of =cohendiv=. The key invariant is the nonlinear equality
=x=qy+r=, which describes the precise behavior of integer division: the
dividend =x= equals the divisor =y= times the quotient =q= plus the
remainder =r=.

The other inequalities also provide useful information for debugging.
For example, the invariants at the program exit reveal several required
properties of the remainder =r=, e.g., non-negative (=0 <= r=), at most
the dividend (=r <= x=), but strictly less than the divisor
(=r <= y - 1=).

*** Complexity Analysis
    :PROPERTIES:
    :CUSTOM_ID: complexity-analysis
    :END:

Another rather surprising use of nonlinear equation is to characterize
the /exact/ computational complexity of a program, which is useful for
identifying possible security problems. Consider the problem of
determining the runtime complexity of the program =tripple= below. At
first, =tripple= appears to take =O(NMP)= due to the three nested loops.
A closer analysis shows a more precise bound =O(N+NM+P)= because the
inner most loop, which is updated each time the middle loop executes,
changes the behavior of the outer most loop.

#+BEGIN_SRC C
  int tripple(int M, int N, int P){
      assert(0 <= M);
      assert(0 <= N);
      assert(0 <= P);
       
      int t = 0; // counter variable
      int i = 0;
      int j = 0;
      int k = 0;
      while(i < N){
          j = 0;
          while(j < M){          
              j = j + 1;
              k = i;
              t++;
              while(k < P){           
                  k = k + 1;
                  t++;
              }
              i = k;
          }
          i = i + 1;
          t++;
      }
       
      /* inferred invariants
      1. M^2*N*t - M^2*P*t + M*N*P*t - M*P^2*t - M*N*t^2 + M*P*t^2 + 2*M*N*t - M*P*t + N*P*t - M*t^2 - N*t^2 - P*t^2 + t^3 + N*t - t^2 == 0
      2. 0 <= N
      3. 0 <= P 
      4. 0 <= M 
      5. N  <= t
      */

      return 0;
  }
#+END_SRC

When given this program, DIG discovers the invariants given as comments
in =tripple=. Among these, the nonlinear equality =1= is rather
interesting and complex. This invariant involves =t=, which is a ghost
variable introduced to count loop iterations.

This nonlinear equality is valid, but looks incomprehensible and quite
different than the expected bound =N+NM+P= or even =NMP=. However, when
solving this equation for =t= (finding the roots of =t=), we obtain
three solutions showing that this program has different time
complexities:

#+BEGIN_EXAMPLE
  t == 0
  t == M + P + 1
  t == N - M(P - N)
#+END_EXAMPLE

Manual analysis further shows the precondition over the inputs leading
to each complexity:

#+BEGIN_EXAMPLE
  t == 0 when N == 0
  t == P + M + 1 when N <= P
  t == N - M(P - N) when N > P
#+END_EXAMPLE

Indeed, these results represent the *exact* complexity bound of
=tripple= and are more precise than the bound =O(N+MN+P)= analyzed
above. Note that =O(N+MN+P)= is still a correct /upperbound/ of
=tripple= (e.g., when =N > P= then =O(N+NM+P) = O(N+NM)=, which is
equivalent to =O(N-M(P-N)) = O(N+MN)=).

