people/nguyenthanhvuh/old/posts/nla.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="nonlinear invariants">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Nonlinear Invariants</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">01 Jun 2020</div><h1 class="post-title"><a href="./nla.html">Nonlinear Invariants</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#examples">1. Examples</a>
<ul>
<li><a href="#capturing-program-semantics">1.1. Capturing Program Semantics</a></li>
<li><a href="#complexity-analysis">1.2. Complexity Analysis</a></li>
<li><a href="#representing-sortedness-and-permutation-properties">1.3. Representing Sortedness and Permutation Properties</a></li>
</ul>
</li>
<li><a href="#dynamic-inference">2. <span class="todo TODO">TODO</span> Dynamic Inference</a>
<ul>
<li><a href="#equation-solving">2.1. <span class="todo TODO">TODO</span> Equation Solving</a></li>
<li><a href="#deep-neural-network">2.2. <span class="todo TODO">TODO</span> Deep Neural Network</a></li>
</ul>
</li>
<li><a href="#static-proving">3. <span class="todo TODO">TODO</span> Static Proving</a>
<ul>
<li><a href="#proving-invariants">3.1. Proving Invariants</a></li>
<li><a href="#inductive-loop-invariants">3.2. <span class="todo TODO">TODO</span> Inductive Loop invariants</a></li>
<li><a href="#strengthening">3.3. <span class="todo TODO">TODO</span> Strengthening</a></li>
<li><a href="#k-induction">3.4. <span class="todo TODO">TODO</span> K-Induction</a></li>
</ul>
</li>
<li><a href="#optimization">4. <span class="todo TODO">TODO</span> Optimization</a>
<ul>
<li><a href="#orge0916cf">4.1. Using Derivatives to Estimate Maximum Degrees in Nonlinear</a></li>
</ul>
</li>
<li><a href="#reduction">5. <span class="todo TODO">TODO</span> Reduction</a>
<ul>
<li><a href="#groebner-basis">5.1. <span class="todo TODO">TODO</span> Groebner Basis</a></li>
<li><a href="#constraint-solving">5.2. <span class="todo TODO">TODO</span> Constraint Solving</a></li>
</ul>
</li>
<li><a href="#more-examples">6. More Examples</a></li>
</ul>
</div>
</nav>

<div id="outline-container-examples" class="outline-2">
<h2 id="examples"><span class="section-number-2">1.</span> Examples</h2>
<div class="outline-text-2" id="text-examples">
</div>

<div id="outline-container-capturing-program-semantics" class="outline-3">
<h3 id="capturing-program-semantics"><span class="section-number-3">1.1.</span> Capturing Program Semantics</h3>
<div class="outline-text-3" id="text-capturing-program-semantics">
<p>
Nonlinear equalities can capture precise program semantics involving
nontrivial arithmetics. Consider the <code>cohendiv</code> integer division
algorithm below.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">cohendiv</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">y</span>){
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">performs integer division x // y</span>

    assert(x &gt;= 1 &amp;&amp; y &gt;= 1);
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">q</span> = 0;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">r</span> = x;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">a</span> = 0;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">b</span> = 0;
    <span style="color: #51afef;">while</span>(1) {
        <span style="color: #51afef;">if</span>(<span style="color: #51afef; font-weight: bold;">!</span>(r&gt;=y)) <span style="color: #51afef;">break</span>;

        a=1;
        b=y;
        <span style="color: #51afef;">while</span> (1){
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">l1: inferred invariants</span>
            <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">            1. x = qy+r</span>
<span style="color: #5B6268;">            2. ay = b</span>
<span style="color: #5B6268;">            3. b &lt;= x</span>
<span style="color: #5B6268;">            4. y &lt;= r</span>
<span style="color: #5B6268;">            5. 0 &lt;= q</span>
<span style="color: #5B6268;">            6. 1 &lt;= b</span>
<span style="color: #5B6268;">            7. 1 &lt;= y</span>
<span style="color: #5B6268;">            */</span>

            <span style="color: #51afef;">if</span>(<span style="color: #51afef; font-weight: bold;">!</span>(r &gt;= 2*b)) <span style="color: #51afef;">break</span>;
            a = 2*a;
            b = 2*b;
        }
        r = r - b;
        q = q + a;
    }

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">l2: inferred invariants</span>
    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">    1. x = yq*r</span>
<span style="color: #5B6268;">    2. ay = b</span>
<span style="color: #5B6268;">    3. r &lt;= y - 1</span>
<span style="color: #5B6268;">    4. 0 &lt;= r</span>
<span style="color: #5B6268;">    5. r &lt;= x</span>
<span style="color: #5B6268;">    */</span>
    <span style="color: #51afef;">return</span> q;
}
</pre>
</div>

<p>
DIG automatically discovers the loop invariants at <code>l1</code> and the
postconditions at <code>l2</code> shown as comments in the code. These relations
are sufficiently strong to understand the semantics and verify the
correctness of <code>cohendiv</code>. The key invariant is the nonlinear equality
<code>x=qy+r</code>, which describes the precise behavior of integer division: the
dividend <code>x</code> equals the divisor <code>y</code> times the quotient <code>q</code> plus the
remainder <code>r</code>.
</p>

<p>
The other inequalities also provide useful information for debugging.
For example, the invariants at the program exit reveal several required
properties of the remainder <code>r</code>, e.g., non-negative (<code>0 &lt;</code> r=), at most
the dividend (<code>r &lt;</code> x=), but strictly less than the divisor
(<code>r &lt;</code> y - 1=).
</p>
</div>
</div>

<div id="outline-container-complexity-analysis" class="outline-3">
<h3 id="complexity-analysis"><span class="section-number-3">1.2.</span> Complexity Analysis</h3>
<div class="outline-text-3" id="text-complexity-analysis">
<p>
Another rather surprising use of nonlinear equation is to characterize
the <i>exact</i> computational complexity of a program, which is useful for
identifying possible security problems. Consider the problem of
determining the runtime complexity of the program <code>tripple</code> below. At
first, <code>tripple</code> appears to take <code>O(NMP)</code> due to the three nested loops.
A closer analysis shows a more precise bound <code>O(N+NM+P)</code> because the
inner most loop, which is updated each time the middle loop executes,
changes the behavior of the outer most loop.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">tripple</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">M</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">N</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">P</span>){
    assert(0 &lt;= M);
    assert(0 &lt;= N);
    assert(0 &lt;= P);

    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">t</span> = 0; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">counter variable</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = 0;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">j</span> = 0;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">k</span> = 0;
    <span style="color: #51afef;">while</span>(i &lt; N){
        j = 0;
        <span style="color: #51afef;">while</span>(j &lt; M){          
            j = j + 1;
            k = i;
            t++;
            <span style="color: #51afef;">while</span>(k &lt; P){           
                k = k + 1;
                t++;
            }
            i = k;
        }
        i = i + 1;
        t++;
    }

    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">inferred invariants</span>
<span style="color: #5B6268;">    1. M^2*N*t - M^2*P*t + M*N*P*t - M*P^2*t - M*N*t^2 + M*P*t^2 + 2*M*N*t - M*P*t + N*P*t - M*t^2 - N*t^2 - P*t^2 + t^3 + N*t - t^2 == 0</span>
<span style="color: #5B6268;">    2. 0 &lt;= N</span>
<span style="color: #5B6268;">    3. 0 &lt;= P </span>
<span style="color: #5B6268;">    4. 0 &lt;= M </span>
<span style="color: #5B6268;">    5. N  &lt;= t</span>
<span style="color: #5B6268;">    */</span>

    <span style="color: #51afef;">return</span> 0;
}
</pre>
</div>

<p>
When given this program, DIG discovers the invariants given as comments
in <code>tripple</code>. Among these, the nonlinear equality <code>1</code> is rather
interesting and complex. This invariant involves <code>t</code>, which is a ghost
variable introduced to count loop iterations.
</p>

<p>
This nonlinear equality is valid, but looks incomprehensible and quite
different than the expected bound <code>N+NM+P</code> or even <code>NMP</code>. However, when
solving this equation for <code>t</code> (finding the roots of <code>t</code>), we obtain
three solutions showing that this program has different time
complexities:
</p>

<pre class="example" id="org6222d00">
t == 0
t == M + P + 1
t == N - M(P - N)
</pre>

<p>
Manual analysis further shows the precondition over the inputs leading
to each complexity:
</p>

<pre class="example" id="org7c2018a">
t == 0 when N == 0
t == P + M + 1 when N &lt;= P
t == N - M(P - N) when N &gt; P
</pre>

<p>
Indeed, these results represent the <b>exact</b> complexity bound of
<code>tripple</code> and are more precise than the bound <code>O(N+MN+P)</code> analyzed
above. Note that <code>O(N+MN+P)</code> is still a correct <i>upperbound</i> of
<code>tripple</code> (e.g., when <code>N &gt; P</code> then <code>O(N+NM+P) = O(N+NM)</code>, which is
equivalent to <code>O(N-M(P-N)) = O(N+MN)</code>).
</p>
</div>
</div>
