people/nguyenthanhvuh/old/drafts/nla.org
*** Representing Sortedness and Permutation Properties
    :PROPERTIES:
    :CUSTOM_ID: representing-sortedness-and-permutation-properties
    :END:

In this example we illustrate that nonlinear equalities can capture the
permutation property required for sorting numbers. DIG can infer these
nonlinear equalities and other invariants to capture both permutation
and sortedness properties.

#+BEGIN_SRC C
  int sort3(int x0, int x1, int x2){
      ...
      /* invariants (postconds)
      1. y0 - y1 <= 0
      2. y1 - y2 <= 0
      3. x0 + x1 + x2 - y0 - y1 - y2 == 0
      4. x1^2 + x1*x2 + x2^2 - x1*y0 - x2*y0 - x1*y1 - x2*y1 + y0*y1 - x1*y2 - x2*y2 + y0*y2 + y1*y2 == 0
      5. x2^3 - x2^2*y0 - x2^2*y1 + x2*y0*y1 - x2^2*y2 + x2*y0*y2 + x2*y1*y2 - y0*y1*y2 == 0
      6. min(x0, x1, x2) - y0 == 0
      7. y2 - max(x0, x1, x2) == 0
      */
      return (y1, y2, y3);
  }
#+END_SRC

The above program =sort3= sorts 3 numbers =x0, x1, x2= as =y0, y1, y2=.
DIG obtained the 7 invariants shown in the program. We show that these
invariants establish the correctness of this function, i.e., the outputs
are sorted and a permutation of the inputs.

1. The inequalities =1= and =2= shows that the output are sorted in
   ascending order, i.e., =y0 <= y1 <= y2=.

2. The next three equalities =4=, =5=, and =6= (especially =5= and =6=)
   are more complex and unexpected, but essentially together they
   indicate that the three outputs represent all possible permutations
   over the three inputs.

   1. First, by factoring eqt =6=, we get

   #+BEGIN_SRC C
     x2^3 - x2^2*y0 - x2^2*y1 + x2*y0*y1 - x2^2*y2 + x2*y0*y2 + x2*y1*y2 - y0*y1*y2 == 0 
     <=> (x2 - y0) (x2 - y1) (x2 - y2) == 0
   #+END_SRC

   This shows that =x2= can be =y0=, =y1=, or =y2=, i.e., =x2 == y0= ,
   =x2 == y1=, =x2 == y2=. Then for each of the cases, we combine with
   equality =5= and then factor it to obtain values for =x1=. For
   example, for =x2=y0=, we get

   #+BEGIN_SRC C
     (x2 == y0) and (x1^2 + x1x2 + x2^2 - x1y0 - x2y0 - x1y1 - x2y1 + y0y1 - x1y2 - x2y2 + y0y2 + y1y2 == 0)
     <=> (x1^2 - x1y1  - x1y2 + y1y2 == 0) <=> (x1 - y1) (x1 - y2) == 0
   #+END_SRC

   This shows that =x1 == y1= or =x1 == y2= when =x2 == y0=. We now can
   combine each case with equality =3= to obtain =x0=. For example, for
   =x1 == y2=, we get

   #+BEGIN_SRC C
     x2 == y0 and x1 == y2 and x0 + x1 + x2 - y0 - y1 - y2 == 0 
     <=> x0 - y1 == 0 
   #+END_SRC

   This shows that =x0 == y1= when =x1 == y2= and =x2 == y0=. Moreover,
   this result, =x0 == y1=, =x1 == y2]=, =x2 == y0=, is a permutation of
   the three inputs.

   If we expand all cases as shown, we will obtain all 6 permutations of
   =x1,x2,x3=.

3. Invariants =6= and =7= shows that =y0= and =y2= are the smallest and
   largest inputs, respectively. Technically, these are redundant
   because we can deduce them from the other invariants (which capture
   sortedness and permutations). But DIG still returns =6= and =7=
   because it might not be straightforward to understand the other
   invariants and realize that together they imply =6= and =7=.

** TODO Dynamic Inference
   :PROPERTIES:
   :CUSTOM_ID: dynamic-inference
   :END:

*** TODO Equation Solving
    :PROPERTIES:
    :CUSTOM_ID: equation-solving
    :END:

*** TODO Deep Neural Network
    :PROPERTIES:
    :CUSTOM_ID: deep-neural-network
    :END:

** TODO Static Proving
   :PROPERTIES:
   :CUSTOM_ID: static-proving
   :END:

*** Proving Invariants
    :PROPERTIES:
    :CUSTOM_ID: proving-invariants
    :END:

Consider the program =sqrt= below, which computes the square root of an
integer using only addition. Our goal is to infer the loop invariants at
location =l= in the program.

#+BEGIN_SRC C
  int sqrt(int x){
    assert(x>=0); //precondition

    int a=0,s=1,t=1;
    while{
      // l: dynamically inferred invariants
      /*
      t =  2a + 1
      4s = t^2 + 2t + 1
      s = (a + 1)^2
      s >= t
      x <=  9989
      */
      if (!(s <= x)) break;
      a += 1;
      t += 2;
      s += t;
    }
    return a;
  }
#+END_SRC

The invariants given in the comments are /candidate/ invariants inferred
using dynamic analysis over some program execution traces, which are
obtained by running the program on some finite inputs. To determine if
these candiate invariants are valid, we need to formally prove them:
ones that are proved are kept and those that are disproved are removed.

