people/nguyenthanhvuh/old/posts/nla.html

<div id="outline-container-representing-sortedness-and-permutation-properties" class="outline-3">
<h3 id="representing-sortedness-and-permutation-properties"><span class="section-number-3">1.3.</span> Representing Sortedness and Permutation Properties</h3>
<div class="outline-text-3" id="text-representing-sortedness-and-permutation-properties">
<p>
In this example we illustrate that nonlinear equalities can capture the
permutation property required for sorting numbers. DIG can infer these
nonlinear equalities and other invariants to capture both permutation
and sortedness properties.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">sort3</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x0</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x1</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x2</span>){
    ...
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">invariants (postconds)</span>
<span style="color: #5B6268;">    1. y0 - y1 &lt;= 0</span>
<span style="color: #5B6268;">    2. y1 - y2 &lt;= 0</span>
<span style="color: #5B6268;">    3. x0 + x1 + x2 - y0 - y1 - y2 == 0</span>
<span style="color: #5B6268;">    4. x1^2 + x1*x2 + x2^2 - x1*y0 - x2*y0 - x1*y1 - x2*y1 + y0*y1 - x1*y2 - x2*y2 + y0*y2 + y1*y2 == 0</span>
<span style="color: #5B6268;">    5. x2^3 - x2^2*y0 - x2^2*y1 + x2*y0*y1 - x2^2*y2 + x2*y0*y2 + x2*y1*y2 - y0*y1*y2 == 0</span>
<span style="color: #5B6268;">    6. min(x0, x1, x2) - y0 == 0</span>
<span style="color: #5B6268;">    7. y2 - max(x0, x1, x2) == 0</span>
<span style="color: #5B6268;">    */</span>
    <span style="color: #51afef;">return</span> (y1, y2, y3);
}
</pre>
</div>

<p>
The above program <code>sort3</code> sorts 3 numbers <code>x0, x1, x2</code> as <code>y0, y1, y2</code>.
DIG obtained the 7 invariants shown in the program. We show that these
invariants establish the correctness of this function, i.e., the outputs
are sorted and a permutation of the inputs.
</p>

<ol class="org-ol">
<li>The inequalities <code>1</code> and <code>2</code> shows that the output are sorted in
ascending order, i.e., <code>y0 &lt;</code> y1 &lt;= y2=.</li>

<li><p>
The next three equalities <code>4</code>, <code>5</code>, and <code>6</code> (especially <code>5</code> and <code>6</code>)
are more complex and unexpected, but essentially together they
indicate that the three outputs represent all possible permutations
over the three inputs.
</p>

<ol class="org-ol">
<li>First, by factoring eqt <code>6</code>, we get</li>
</ol>

<div class="org-src-container">
<pre class="src src-C">x2^3 - x2^2*y0 - x2^2*y1 + x2*y0*y1 - x2^2*y2 + x2*y0*y2 + x2*y1*y2 - y0*y1*y2 == 0 
&lt;=&gt; (x2 - y0) (x2 - y1) (x2 - y2) == 0
</pre>
</div>

<p>
This shows that <code>x2</code> can be <code>y0</code>, <code>y1</code>, or <code>y2</code>, i.e., <code>x2 =</code> y0= ,
<code>x2 =</code> y1=, <code>x2 =</code> y2=. Then for each of the cases, we combine with
equality <code>5</code> and then factor it to obtain values for <code>x1</code>. For
example, for <code>x2=y0</code>, we get
</p>

<div class="org-src-container">
<pre class="src src-C">(x2 == y0) <span style="color: #c678dd;">and</span> (x1^2 + x1x2 + x2^2 - x1y0 - x2y0 - x1y1 - x2y1 + y0y1 - x1y2 - x2y2 + y0y2 + y1y2 == 0)
&lt;=&gt; (x1^2 - x1y1  - x1y2 + y1y2 == 0) &lt;=&gt; (x1 - y1) (x1 - y2) == 0
</pre>
</div>

<p>
This shows that <code>x1 =</code> y1= or <code>x1 =</code> y2= when <code>x2 =</code> y0=. We now can
combine each case with equality <code>3</code> to obtain <code>x0</code>. For example, for
<code>x1 =</code> y2=, we get
</p>

<div class="org-src-container">
<pre class="src src-C">x2 == y0 and x1 == y2 and x0 + x1 + x2 - y0 - y1 - y2 == 0 
&lt;=&gt; x0 - y1 == 0 
</pre>
</div>

<p>
This shows that <code>x0 =</code> y1= when <code>x1 =</code> y2= and <code>x2 =</code> y0=. Moreover,
this result, <code>x0 =</code> y1=, <code>x1 =</code> y2]=, <code>x2 =</code> y0=, is a permutation of
the three inputs.
</p>

<p>
If we expand all cases as shown, we will obtain all 6 permutations of
<code>x1,x2,x3</code>.
</p></li>

<li>Invariants <code>6</code> and <code>7</code> shows that <code>y0</code> and <code>y2</code> are the smallest and
largest inputs, respectively. Technically, these are redundant
because we can deduce them from the other invariants (which capture
sortedness and permutations). But DIG still returns <code>6</code> and <code>7</code>
because it might not be straightforward to understand the other
invariants and realize that together they imply <code>6</code> and <code>7</code>.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-dynamic-inference" class="outline-2">
<h2 id="dynamic-inference"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Dynamic Inference</h2>
<div class="outline-text-2" id="text-dynamic-inference">
</div>

<div id="outline-container-equation-solving" class="outline-3">
<h3 id="equation-solving"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> Equation Solving</h3>
<div class="outline-text-3" id="text-equation-solving">
</div>
</div>

<div id="outline-container-deep-neural-network" class="outline-3">
<h3 id="deep-neural-network"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> Deep Neural Network</h3>
<div class="outline-text-3" id="text-deep-neural-network">
</div>
</div>
</div>

<div id="outline-container-static-proving" class="outline-2">
<h2 id="static-proving"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Static Proving</h2>
<div class="outline-text-2" id="text-static-proving">
</div>

<div id="outline-container-proving-invariants" class="outline-3">
<h3 id="proving-invariants"><span class="section-number-3">3.1.</span> Proving Invariants</h3>
<div class="outline-text-3" id="text-proving-invariants">
<p>
Consider the program <code>sqrt</code> below, which computes the square root of an
integer using only addition. Our goal is to infer the loop invariants at
location <code>l</code> in the program.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">sqrt</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span>){
  assert(x&gt;=0); <span style="color: #5B6268;">//</span><span style="color: #5B6268;">precondition</span>

  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">a</span>=0,<span style="color: #dcaeea;">s</span>=1,<span style="color: #dcaeea;">t</span>=1;
  <span style="color: #51afef;">while</span>{
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">l: dynamically inferred invariants</span>
    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">    t =  2a + 1</span>
<span style="color: #5B6268;">    4s = t^2 + 2t + 1</span>
<span style="color: #5B6268;">    s = (a + 1)^2</span>
<span style="color: #5B6268;">    s &gt;= t</span>
<span style="color: #5B6268;">    x &lt;=  9989</span>
<span style="color: #5B6268;">    */</span>
    <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>(s &lt;= x)) <span style="color: #51afef;">break</span>;
    a += 1;
    t += 2;
    s += t;
  }
  <span style="color: #51afef;">return</span> a;
}
</pre>
</div>

<p>
The invariants given in the comments are <i>candidate</i> invariants inferred
using dynamic analysis over some program execution traces, which are
obtained by running the program on some finite inputs. To determine if
these candiate invariants are valid, we need to formally prove them:
ones that are proved are kept and those that are disproved are removed.
</p>
</div>
</div>
