people/nguyenthanhvuh/old/drafts/nla.org
*** TODO Inductive Loop invariants
    :PROPERTIES:
    :CUSTOM_ID: inductive-loop-invariants
    :END:

A loop invariant is a property that is hold whenever the progarm enters
the loop, e.g., any property that holds at location =l= is the loop
invariant of the =while= loop in the =sqrt= program above. One popular
way to show if a property =I= is a loop invariant is using /standard
induction/ technique, which consists of two parts 1. we shows that =I=
holds the first time the loop is entered 2. we assume that =I= holds
when the loop is entered and shows that =I= is preserved after the loop
body is executed.

Loop invariants that are showed using such an induction technique are
called *inductive loop invariants*. Note that if this induction
technique fails (e.g., either 1 or 2 or both fail), then that just means
standard induction cannot prove the property. It does not mean that the
property is not a loop invariant as there are invariants that /cannot/
be proved using induction (more on this later).

*Example*: For the program =sqrt=, we prove that =t == 2a + 1= and
=4s == t^2 + 2t + 1= are inductive loop invariants:

#+BEGIN_EXAMPLE
  # t == 2a + 1:
  1. (x >= 0 && a == 0 && s == 1 && t == 1)  => t == 2a + 1  # checked
  2.  (t == 2a + 1 && s <= x && a' == a + 1 && t' == t + 2 && s' == s + t')  
      => t' == 2a + 1 + 2 =>  t' == 2(a' - 1) + 3 
      => t' == 2a' + 1   #checked

  # 4s == t^2 + 2t + 1  # checked
  1. (x >= 0 && a == 0 && s == 1 && t == 1)  => 4s == t^2 + 2t + 1
  2. (4s == t^2 + 2t + 1 && s <= x && a' == a + 1 && t' == t + 2 && s' == s + t') 
    => 4(s' - t') == (t' - 2)^2 + 2(t' - 2) + 1 
    => 4s' == t'^2 + 2t' + 1  #checked
#+END_EXAMPLE

However, we cannot use standard induction to show the other properties
=s == (a + 1)^2= and =s >= t=.

#+BEGIN_EXAMPLE
  # s == (a + 1)^2:
  1. (x >= 0 && a == 0 && s == 1 && t == 1)  => s == (a + 1)^2  # this is ok
  2.  (s == (a + 1)^2 + 1 && s <= x && a' == a + 1 && t' == t + 2 && s' == s + t')  
      => 
      => t' == 2a' + 1

  # 4s == t^2 + 2t + 1
  1. (x >= 0 && a == 0 && s == 1 && t == 1)  => 4s == t^2 + 2t + 1
  2. (4s == t^2 + 2t + 1 && s <= x && a' == a + 1 && t' == t + 2 && s' == s + t') 
    => 4(s' - t') == (t' - 2)^2 + 2(t' - 2) + 1 
    => 4s' == t'^2 + 2t' + 1
#+END_EXAMPLE

*** TODO Strengthening
    :PROPERTIES:
    :CUSTOM_ID: strengthening
    :END:

*** TODO K-Induction
    :PROPERTIES:
    :CUSTOM_ID: k-induction
    :END:

KIP successfully distinguishes true and false invariants from these
results. Specifically, we prove are inductive invariants and
$s == (a+1)^2$ is a $1$-inductive invariant (i.e., cannot be proved
using standard induction). By using proved results as lemmas, KIP is
able to show the invariant $s \ge t$, which is not $k$-inductive for
$k \le \mathsf{maxK}$, where $\mathsf{maxK}=5$ is the default setting of
KIP. The prover also rejects spurious relations such as $x\le 9989$ by
producing counterexamples that invalidate those relations in \lt{sqrt}.
The parallel implementation allows the prover to check these candidate
results simultaneously.

--------------

A program execution can be modeled as a state transition system
$M=(I,T)$ with $I$ representing the initial state of $M$, and $T$
specifying the transition relation of $M$ from a state $n-1$ to a state
$n$. To prove that $p$ is a \emph{state invariant} that holds at every
state of $M$, $k$-induction requires that $p$ hold for the first $k+1$
states (base case) and that $p$ hold for the state $n+k+1$ assuming that
it holds for the $k+1$ previous states (induction step). Formally,
$k$-induction proves the state invariant $p$ of $M=(I,T)$ by checking
the base case and induction step formulas:

\footnotesize
\begin{align}
  I \wedge T_1 \wedge \dots \wedge T_k \;&\Rightarrow \; p_0 \wedge \dots \wedge p_k\label{kind-1}\\
  p_n \wedge T_{n+1} \wedge  \dots \wedge p_{n+k} \wedge T_{n+k+1} \;&\Rightarrow \; p_{n+k+1}\label{kind-2}
\end{align} \normalsize

\noindent If both formulas hold then $p$ is a $k$-inductive invariant.
If the base case~\eqref{kind-1} fails then $p$ is disproved and thus is
not an invariant (assuming that $M$ correctly models the program).
However, if the base case holds but the induction step~\eqref{kind-2}
fails, then $p$ is not a $k$-inductive invariant, but it could still be
a program invariant. Thus, $k$-induction is a sound but incomplete proof
technique.

By considering multiple consecutive transitions, $k$-induction can prove
invariants that cannot be proved by standard induction ($0$-induction in
this formulation). For instance, the invariant $x\ne y$ of the machine
$M(I: (x=0 \wedge y=1 \wedge z=2)_0$,
$T_n: x_n == y_{n-1} \wedge y_n == z_{n-1} \wedge z_n = x_{n-1}$) that
rotates the values $0,1,2$ through the variables $x,y,z$ is not provable
by standard induction but is $k$-inductive with $k \ge 3$.\\
The notation $(P)_i$ denotes the formula $P$ with all free variables
subscripted by $i$, e.g., $(x + y == 1)_0$ is $x_0 + y_0 == 1$.

** TODO Optimization
   :PROPERTIES:
   :CUSTOM_ID: optimization
   :END:

*** Using Derivatives to Estimate Maximum Degrees in Nonlinear
Invariants
    :PROPERTIES:
    :CUSTOM_ID: using-derivatives-to-estimate-maximum-degrees-in-nonlinear-invariants
    :END:

** TODO Reduction
   :PROPERTIES:
   :CUSTOM_ID: reduction
   :END:

*** TODO Groebner Basis
    :PROPERTIES:
    :CUSTOM_ID: groebner-basis
    :END:

*** TODO Constraint Solving
    :PROPERTIES:
    :CUSTOM_ID: constraint-solving
    :END:

--------------

** More Examples
   :PROPERTIES:
   :CUSTOM_ID: more-examples
   :END:

#+BEGIN_SRC C
  int bressenham(){


  }
#+END_SRC
