people/nguyenthanhvuh/old/posts/nla.html

<div id="outline-container-inductive-loop-invariants" class="outline-3">
<h3 id="inductive-loop-invariants"><span class="section-number-3">3.2.</span> <span class="todo TODO">TODO</span> Inductive Loop invariants</h3>
<div class="outline-text-3" id="text-inductive-loop-invariants">
<p>
A loop invariant is a property that is hold whenever the progarm enters
the loop, e.g., any property that holds at location <code>l</code> is the loop
invariant of the <code>while</code> loop in the <code>sqrt</code> program above. One popular
way to show if a property <code>I</code> is a loop invariant is using <i>standard
induction</i> technique, which consists of two parts 1. we shows that <code>I</code>
holds the first time the loop is entered 2. we assume that <code>I</code> holds
when the loop is entered and shows that <code>I</code> is preserved after the loop
body is executed.
</p>

<p>
Loop invariants that are showed using such an induction technique are
called <b>inductive loop invariants</b>. Note that if this induction
technique fails (e.g., either 1 or 2 or both fail), then that just means
standard induction cannot prove the property. It does not mean that the
property is not a loop invariant as there are invariants that <i>cannot</i>
be proved using induction (more on this later).
</p>

<p>
<b>Example</b>: For the program <code>sqrt</code>, we prove that <code>t =</code> 2a + 1= and
<code>4s =</code> t<sup>2</sup> + 2t + 1= are inductive loop invariants:
</p>

<pre class="example" id="orgef34c18">
# t == 2a + 1:
1. (x &gt;= 0 &amp;&amp; a == 0 &amp;&amp; s == 1 &amp;&amp; t == 1)  =&gt; t == 2a + 1  # checked
2.  (t == 2a + 1 &amp;&amp; s &lt;= x &amp;&amp; a' == a + 1 &amp;&amp; t' == t + 2 &amp;&amp; s' == s + t')  
    =&gt; t' == 2a + 1 + 2 =&gt;  t' == 2(a' - 1) + 3 
    =&gt; t' == 2a' + 1   #checked

# 4s == t^2 + 2t + 1  # checked
1. (x &gt;= 0 &amp;&amp; a == 0 &amp;&amp; s == 1 &amp;&amp; t == 1)  =&gt; 4s == t^2 + 2t + 1
2. (4s == t^2 + 2t + 1 &amp;&amp; s &lt;= x &amp;&amp; a' == a + 1 &amp;&amp; t' == t + 2 &amp;&amp; s' == s + t') 
  =&gt; 4(s' - t') == (t' - 2)^2 + 2(t' - 2) + 1 
  =&gt; 4s' == t'^2 + 2t' + 1  #checked
</pre>

<p>
However, we cannot use standard induction to show the other properties
<code>s =</code> (a + 1)<sup>2</sup>= and <code>s &gt;</code> t=.
</p>

<pre class="example" id="org7e6b625">
# s == (a + 1)^2:
1. (x &gt;= 0 &amp;&amp; a == 0 &amp;&amp; s == 1 &amp;&amp; t == 1)  =&gt; s == (a + 1)^2  # this is ok
2.  (s == (a + 1)^2 + 1 &amp;&amp; s &lt;= x &amp;&amp; a' == a + 1 &amp;&amp; t' == t + 2 &amp;&amp; s' == s + t')  
    =&gt; 
    =&gt; t' == 2a' + 1

# 4s == t^2 + 2t + 1
1. (x &gt;= 0 &amp;&amp; a == 0 &amp;&amp; s == 1 &amp;&amp; t == 1)  =&gt; 4s == t^2 + 2t + 1
2. (4s == t^2 + 2t + 1 &amp;&amp; s &lt;= x &amp;&amp; a' == a + 1 &amp;&amp; t' == t + 2 &amp;&amp; s' == s + t') 
  =&gt; 4(s' - t') == (t' - 2)^2 + 2(t' - 2) + 1 
  =&gt; 4s' == t'^2 + 2t' + 1
</pre>
</div>
</div>

<div id="outline-container-strengthening" class="outline-3">
<h3 id="strengthening"><span class="section-number-3">3.3.</span> <span class="todo TODO">TODO</span> Strengthening</h3>
<div class="outline-text-3" id="text-strengthening">
</div>
</div>

<div id="outline-container-k-induction" class="outline-3">
<h3 id="k-induction"><span class="section-number-3">3.4.</span> <span class="todo TODO">TODO</span> K-Induction</h3>
<div class="outline-text-3" id="text-k-induction">
<p>
KIP successfully distinguishes true and false invariants from these
results. Specifically, we prove are inductive invariants and
\(s == (a+1)^2\) is a $1$-inductive invariant (i.e., cannot be proved
using standard induction). By using proved results as lemmas, KIP is
able to show the invariant \(s \ge t\), which is not $k$-inductive for
\(k \le \mathsf{maxK}\), where \(\mathsf{maxK}=5\) is the default setting of
KIP. The prover also rejects spurious relations such as \(x\le 9989\) by
producing counterexamples that invalidate those relations in &lt;{sqrt}.
The parallel implementation allows the prover to check these candidate
results simultaneously.
</p>

<hr>

<p>
A program execution can be modeled as a state transition system
\(M=(I,T)\) with \(I\) representing the initial state of \(M\), and \(T\)
specifying the transition relation of \(M\) from a state \(n-1\) to a state
\(n\). To prove that \(p\) is a \emph{state invariant} that holds at every
state of \(M\), $k$-induction requires that \(p\) hold for the first \(k+1\)
states (base case) and that \(p\) hold for the state \(n+k+1\) assuming that
it holds for the \(k+1\) previous states (induction step). Formally,
$k$-induction proves the state invariant \(p\) of \(M=(I,T)\) by checking
the base case and induction step formulas:
</p>

<p>
\footnotesize
\begin{align}
  I &and; T<sub>1</sub> &and; &hellip; &and; T<sub>k</sub> \;&amp;&rArr; \; p<sub>0</sub> &and; &hellip; &and; p<sub>k\label</sub>{kind-1}<br>
  p<sub>n</sub> &and; T<sub>n+1</sub> &and;  &hellip; &and; p<sub>n+k</sub> &and; T<sub>n+k+1</sub> \;&amp;&rArr; \; p<sub>n+k+1</sub>\label{kind-2}
\end{align} \normalsize
</p>

<p>
\noindent If both formulas hold then \(p\) is a $k$-inductive invariant.
If the base case~\eqref{kind-1} fails then \(p\) is disproved and thus is
not an invariant (assuming that \(M\) correctly models the program).
However, if the base case holds but the induction step~\eqref{kind-2}
fails, then \(p\) is not a $k$-inductive invariant, but it could still be
a program invariant. Thus, $k$-induction is a sound but incomplete proof
technique.
</p>

<p>
By considering multiple consecutive transitions, $k$-induction can prove
invariants that cannot be proved by standard induction ($0$-induction in
this formulation). For instance, the invariant \(x\ne y\) of the machine
\(M(I: (x=0 \wedge y=1 \wedge z=2)_0\),
\(T_n: x_n == y_{n-1} \wedge y_n == z_{n-1} \wedge z_n = x_{n-1}\)) that
rotates the values \(0,1,2\) through the variables \(x,y,z\) is not provable
by standard induction but is $k$-inductive with \(k \ge 3\).<br>
The notation \((P)_i\) denotes the formula \(P\) with all free variables
subscripted by \(i\), e.g., \((x + y == 1)_0\) is \(x_0 + y_0 == 1\).
</p>
</div>
</div>
</div>

<div id="outline-container-optimization" class="outline-2">
<h2 id="optimization"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> Optimization</h2>
<div class="outline-text-2" id="text-optimization">
</div>

<div id="outline-container-orge0916cf" class="outline-3">
<h3 id="orge0916cf"><span class="section-number-3">4.1.</span> Using Derivatives to Estimate Maximum Degrees in Nonlinear</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Invariants
</p>
<p>
:CUSTOM<sub>ID</sub>: using-derivatives-to-estimate-maximum-degrees-in-nonlinear-invariants
</p>
</div>
</div>
</div>

<div id="outline-container-reduction" class="outline-2">
<h2 id="reduction"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Reduction</h2>
<div class="outline-text-2" id="text-reduction">
</div>

<div id="outline-container-groebner-basis" class="outline-3">
<h3 id="groebner-basis"><span class="section-number-3">5.1.</span> <span class="todo TODO">TODO</span> Groebner Basis</h3>
<div class="outline-text-3" id="text-groebner-basis">
</div>
</div>

<div id="outline-container-constraint-solving" class="outline-3">
<h3 id="constraint-solving"><span class="section-number-3">5.2.</span> <span class="todo TODO">TODO</span> Constraint Solving</h3>
<div class="outline-text-3" id="text-constraint-solving">
<hr>
</div>
</div>
</div>

<div id="outline-container-more-examples" class="outline-2">
<h2 id="more-examples"><span class="section-number-2">6.</span> More Examples</h2>
<div class="outline-text-2" id="text-more-examples">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">bressenham</span>(){


}
</pre>
</div>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-blog.html">blog</a> <a href="./tag-research.html">research</a> <a href="./tag-invariants.html">invariants</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
